##### SQL is part of term 1: we will be focussing on the key notes

```
SELECT col1 + col2 as sum
FROM the_table
WHERE col3 = 'US';
```

##### Quiz Arithmatic Operation

```
SELECT id, account_id, standard_amt_usd/standard_qty as unit_price
FROM table
LIMIT 10;
```

##### LIKE

```
SELECT * 
FROM table
WHERE col1 LIKE '%google%'

```
To Search col1 (text column) with a word google in it

##### IN

```
SELECT *
FROM table
WHERE col1 in (1001,1021)
```

##### NOT

```
SELECT *
FROM table
WHERE col1 NOT LIKE '%google%'
```

```
SELECT * 
FROM table
WHERE col1 NOT IN (100,200)
ORDER BY col1 DESC
```

##### AND & BETWEEN

```
SELECT * 
FROM table
WHERE col1 NOT IN (100,150) AND col2 BETWEEN 200 AND 300
```

##### OR and IN being same

```
SELECT *
FROM table
WHERE col1 in (100,200)
```

```
SELECT * 
FROM table
WHERE col1 = 100 OR col1 = 200
```

##### Inner Join

```
SELECT *
FROM table1
JOIN table2
ON table1.col1 = table2.col2
```

##### Join multiple tables

```
SELECT table1.col2, table2.col4, table3.col6
FROM table1
JOIN table2
on table1.col1 = tables2.col2
JOIN table3
on table2.col2 = table3.col3
```

```
SELECT t1.col2, t2.col4, t3.col6
FROM table1 t1
JOIN table2 t2
on t1.col1 = t2.col2
JOIN table3 t3
on t2.col2 = t3.col3
```

##### Left outer join an left join are same

```
SELCT t1.col1, t2.col2
FROM table1 t1
LEFT JOIN  table2 t2
ON t1.col1 = t2.col1
```

##### joining and filtering together: subsets it first (even before to where clause)

```
SELECT t1.c1, t2.c2
FROM table1 t1
JOIN table2 t2
on t1.c1 = t2.c1 and t1.c1 == 100
```

##### Union : generates unique rows

```
SELECT t1.c1
FROM table1 t1
UNION
SELECT t2.c1
FROM table2 t2
```

##### UNION ALL: generates duplicate rows as well

##### CROSS JOIN: when 2 atomic table grow on their own , there may be scenario we check the permutation of it. for e.g. rules and regularization to all the department.

```
SELECT *
FROM table1 t1
CROSS JOIN table2 t2
```

##### SELF JOIN

```
SELECT * 
FROM table1 t1, table1 t2
WHERE t1.city = t2.city and t1.id <> t2.id
```
##### To list all the id with same city. As a replacement to group by